In [61]:
import numpy as np
import pandas as pd

In [62]:
df = pd.DataFrame({
    'column A' : [1,np.nan,30,np.nan],
    'column B' : [2,8,31,np.nan],
    'column C' : [np.nan,9,32,100],
    'column D' : [5,8,34,110]
})

In [63]:
display(df)

   column A  column B  column C  column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [64]:
df.isnull()

   column A  column B  column C  column D
0     False     False      True     False
1      True     False     False     False
2     False     False     False     False
3      True      True     False     False

In [65]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   column A  2 non-null      float64
 1   column B  3 non-null      float64
 2   column C  3 non-null      float64
 3   column D  4 non-null      int64
dtypes: float64(3), int64(1)
memory usage: 256.0 bytes

In [66]:
df.isnull().sum()

column A    2
column B    1
column C    1
column D    0
dtype: int64

In [67]:
df.dropna() #data row yang mengandung null meski satu maka tidak akan dibawa

   column A  column B  column C  column D
2      30.0      31.0      32.0        34

In [68]:
df

   column A  column B  column C  column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [69]:
df_fillBaris = df.fillna(value=0) #mengganti value NaN dengan 0 ,default axis = 0 (baris)

In [70]:
df_fillBaris

   column A  column B  column C  column D
0       1.0       2.0       0.0         5
1       0.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3       0.0       0.0     100.0       110

In [71]:
df_fillBaris = df.fillna(method='ffill') #mengganti NaN dengan nilai sebelumnya atau diatasnya

C:\Users\ratua\AppData\Local\Temp\ipykernel_19836\3354791020.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_fillBaris = df.fillna(method='ffill') #mengganti NaN dengan nilai sebelumnya atau diatasnya

In [72]:
df_fillBaris = df.fillna(method='bfill') #mengganti NaN dengan nilai setelahnya atau dibawahnya

C:\Users\ratua\AppData\Local\Temp\ipykernel_19836\286102300.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_fillBaris = df.fillna(method='bfill') #mengganti NaN dengan nilai setelahnya atau dibawahnya

In [73]:
df_fillBaris

   column A  column B  column C  column D
0       1.0       2.0       9.0         5
1      30.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [79]:
df_fillKolom = df.fillna(value=1,axis=1) #mengganti NaN dengan 1,axis=1 beradaskan kolom

In [78]:
df

   column A  column B  column C  column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [76]:
df_fillKolom

   column A  column B  column C  column D
0       1.0       2.0       1.0       5.0
1       1.0       8.0       9.0       8.0
2      30.0      31.0      32.0      34.0
3       1.0       1.0     100.0     110.0